{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_27","layers":[{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense79","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense80","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense81","trainable":true}}]},"keras_version":"tfjs-layers 4.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.13.0","convertedBy":null,"weightsManifest":[{"paths":["./best-fit.weights.bin"],"weights":[{"name":"dense_Dense79/kernel","shape":[1,50],"dtype":"float32"},{"name":"dense_Dense79/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense80/kernel","shape":[50,50],"dtype":"float32"},{"name":"dense_Dense80/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense81/kernel","shape":[50,1],"dtype":"float32"},{"name":"dense_Dense81/bias","shape":[1],"dtype":"float32"}]}]}